avr-rust/avrd/packs/xmegab/ATxmega64B3.atdf
        <register caption="Calibration Register A" name="CALA" offset="0x02" size="1">
          <bitfield caption="DFLL Calibration Value A" mask="0x7F" name="CALL"/>
        </register>
        <register caption="Calibration Register B" name="CALB" offset="0x03" size="1">
          <bitfield caption="DFLL Calibration Value B" mask="0x3F" name="CALH"/>
        </register>
        <register caption="Oscillator Compare Register 0" name="COMP0" offset="0x04" size="1"/>
        <register caption="Oscillator Compare Register 1" name="COMP1" offset="0x05" size="1"/>
        <register caption="Oscillator Compare Register 2" name="COMP2" offset="0x06" size="1"/>
      </register-group>
    </module>
    <module name="PR" id="I6080" version="XMEGAB" caption="Power Reduction">
      <register-group caption="Power Reduction" name="PR" size="6">
        <register caption="General Power Reduction" name="PRGEN" offset="0x00" size="1">
          <bitfield caption="LCD Module" mask="0x80" name="LCD"/>
          <bitfield caption="USB" mask="0x40" name="USB"/>
          <bitfield caption="AES" mask="0x10" name="AES"/>
          <bitfield caption="Real-time Counter" mask="0x04" name="RTC"/>
          <bitfield caption="Event System" mask="0x02" name="EVSYS"/>
          <bitfield caption="DMA-Controller" mask="0x01" name="DMA"/>
        </register>
        <register caption="Power Reduction Port A" name="PRPA" offset="0x01" size="1">
          <bitfield caption="Port A ADC" mask="0x02" name="ADC"/>
          <bitfield caption="Port A Analog Comparator" mask="0x01" name="AC"/>
        </register>
        <register caption="Power Reduction Port B" name="PRPB" offset="0x02" size="1">
          <bitfield caption="Port B ADC" mask="0x02" name="ADC"/>
          <bitfield caption="Port B Analog Comparator" mask="0x01" name="AC"/>
        </register>
        <register caption="Power Reduction Port C" name="PRPC" offset="0x03" size="1">
          <bitfield caption="Port C Two-wire Interface" mask="0x40" name="TWI"/>
          <bitfield caption="Port C USART0" mask="0x10" name="USART0"/>
          <bitfield caption="Port C SPI" mask="0x08" name="SPI"/>
          <bitfield caption="Port C AWEX" mask="0x04" name="HIRES"/>
          <bitfield caption="Port C Timer/Counter1" mask="0x02" name="TC1"/>
          <bitfield caption="Port C Timer/Counter0" mask="0x01" name="TC0"/>
        </register>
        <register caption="Power Reduction Port E" name="PRPE" offset="0x05" size="1">
          <bitfield caption="Port E USART0" mask="0x10" name="USART0"/>
          <bitfield caption="Port E Timer/Counter0" mask="0x01" name="TC0"/>
        </register>
      </register-group>
    </module>
    <module name="RST" id="I6083" version="XMEGAAU" caption="Reset">
      <register-group caption="Reset" name="RST" size="2">
        <register caption="Status Register" name="STATUS" offset="0x00" size="1">
          <bitfield caption="Spike Detection Reset Flag" mask="0x40" name="SDRF"/>
          <bitfield caption="Software Reset Flag" mask="0x20" name="SRF"/>
          <bitfield caption="Programming and Debug Interface Interface Reset Flag" mask="0x10" name="PDIRF"/>
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on Reset Flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Control Register" name="CTRL" offset="0x01" size="1">
          <bitfield caption="Software Reset" mask="0x01" name="SWRST"/>
        </register>
      </register-group>
    </module>
    <module name="WDT" id="I6078" caption="Watch-Dog Timer">
      <register-group caption="Watch-Dog Timer" name="WDT" size="3">
        <register caption="Control" name="CTRL" offset="0x00" size="1">
          <bitfield caption="Period" mask="0x3C" name="PER" values="WDT_PER"/>
          <bitfield caption="Enable" mask="0x02" name="ENABLE"/>
          <bitfield caption="Change Enable" mask="0x01" name="CEN"/>
        </register>
        <register caption="Windowed Mode Control" name="WINCTRL" offset="0x01" size="1">
          <bitfield caption="Windowed Mode Period" mask="0x3C" name="WPER" values="WDT_WPER"/>
          <bitfield caption="Windowed Mode Enable" mask="0x02" name="WEN"/>
          <bitfield caption="Windowed Mode Change Enable" mask="0x01" name="WCEN"/>
        </register>
        <register caption="Status" name="STATUS" offset="0x02" size="1">
          <bitfield caption="Syncronization busy" mask="0x01" name="SYNCBUSY"/>
        </register>
      </register-group>
      <value-group caption="Period setting" name="WDT_PER">
        <value caption="8 cycles (8ms @ 3.3V)" name="8CLK" value="0x00"/>
        <value caption="16 cycles (16ms @ 3.3V)" name="16CLK" value="0x01"/>
        <value caption="32 cycles (32ms @ 3.3V)" name="32CLK" value="0x02"/>
        <value caption="64 cycles (64ms @ 3.3V)" name="64CLK" value="0x03"/>
        <value caption="128 cycles (0.128s @ 3.3V)" name="128CLK" value="0x04"/>
        <value caption="256 cycles (0.256s @ 3.3V)" name="256CLK" value="0x05"/>
        <value caption="512 cycles (0.512s @ 3.3V)" name="512CLK" value="0x06"/>
        <value caption="1K cycles (1s @ 3.3V)" name="1KCLK" value="0x07"/>
        <value caption="2K cycles (2s @ 3.3V)" name="2KCLK" value="0x08"/>
        <value caption="4K cycles (4s @ 3.3V)" name="4KCLK" value="0x09"/>
        <value caption="8K cycles (8s @ 3.3V)" name="8KCLK" value="0x0A"/>
      </value-group>
      <value-group caption="Closed window period" name="WDT_WPER">
        <value caption="8 cycles (8ms @ 3.3V)" name="8CLK" value="0x00"/>
        <value caption="16 cycles (16ms @ 3.3V)" name="16CLK" value="0x01"/>
        <value caption="32 cycles (32ms @ 3.3V)" name="32CLK" value="0x02"/>
        <value caption="64 cycles (64ms @ 3.3V)" name="64CLK" value="0x03"/>
        <value caption="128 cycles (0.128s @ 3.3V)" name="128CLK" value="0x04"/>
        <value caption="256 cycles (0.256s @ 3.3V)" name="256CLK" value="0x05"/>
        <value caption="512 cycles (0.512s @ 3.3V)" name="512CLK" value="0x06"/>
        <value caption="1K cycles (1s @ 3.3V)" name="1KCLK" value="0x07"/>
        <value caption="2K cycles (2s @ 3.3V)" name="2KCLK" value="0x08"/>
        <value caption="4K cycles (4s @ 3.3V)" name="4KCLK" value="0x09"/>
        <value caption="8K cycles (8s @ 3.3V)" name="8KCLK" value="0x0A"/>
      </value-group>
    </module>
    <module name="MCU" id="I6091" version="XMEGAB" caption="MCU Control">
      <register-group caption="MCU Control" name="MCU" size="12">
        <register caption="Device ID byte 0" name="DEVID0" offset="0x00" size="1"/>
        <register caption="Device ID byte 1" name="DEVID1" offset="0x01" size="1"/>
