avr-rust/avrd/packs/xmegab/ATxmega64B3.atdf
    <module name="ADC" id="I6110" version="XMEGAB" caption="Analog/Digital Converter">
      <register-group caption="ADC Channel" name="ADC_CH" size="8">
        <register caption="Control Register" name="CTRL" offset="0x00" size="1">
          <bitfield caption="Channel Start Conversion" mask="0x80" name="START"/>
          <bitfield caption="Gain Factor" mask="0x1C" name="GAIN" values="ADC_CH_GAIN"/>
          <bitfield caption="Input Mode Select" mask="0x03" name="INPUTMODE" values="ADC_CH_INPUTMODE"/>
        </register>
        <register caption="MUX Control" name="MUXCTRL" offset="0x01" size="1">
          <bitfield caption="MUX selection on Positive ADC input" mask="0x78" name="MUXPOS" values="ADC_CH_MUXPOS"/>
          <bitfield caption="MUX selection on Internal ADC input" mask="0x78" name="MUXINT" values="ADC_CH_MUXINT"/>
          <bitfield caption="MUX selection on Negative ADC input" mask="0x07" name="MUXNEG" values="ADC_CH_MUXNEG"/>
          <bitfield caption="MUX selection on Negative ADC Input Gain on 4 LSB pins" mask="0x07" name="MUXNEGL" values="ADC_CH_MUXNEGL"/>
          <bitfield caption="MUX selection on Negative ADC Input Gain on 4 MSB pins" mask="0x07" name="MUXNEGH" values="ADC_CH_MUXNEGH"/>
        </register>
        <register caption="Channel Interrupt Control Register" name="INTCTRL" offset="0x02" size="1">
          <bitfield caption="Interrupt Mode" mask="0x0C" name="INTMODE" values="ADC_CH_INTMODE"/>
          <bitfield caption="Interrupt Level" mask="0x03" name="INTLVL" values="ADC_CH_INTLVL"/>
        </register>
        <register caption="Interrupt Flags" name="INTFLAGS" offset="0x03" size="1">
          <bitfield caption="Channel Interrupt Flag" mask="0x01" name="CHIF"/>
        </register>
        <register caption="Channel Result" name="RES" offset="0x04" size="2"/>
        <register caption="Input Channel Scan" name="SCAN" offset="0x06" size="1">
          <bitfield caption="Positive MUX setting offset" mask="0xF0" name="OFFSET"/>
          <bitfield caption="Number of Channels included in scan" mask="0x0F" name="COUNT"/>
        </register>
      </register-group>
      <register-group caption="Analog-to-Digital Converter" name="ADC" size="40">
        <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
          <bitfield caption="Channel 0 Start Conversion" mask="0x04" name="CH0START"/>
          <bitfield caption="ADC Flush" mask="0x02" name="FLUSH"/>
          <bitfield caption="Enable ADC" mask="0x01" name="ENABLE"/>
        </register>
        <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
          <bitfield caption="Current limit" mask="0x60" name="CURRLIMIT" values="ADC_CURRLIMIT"/>
          <bitfield caption="Conversion Mode" mask="0x10" name="CONMODE"/>
          <bitfield caption="Free Running Mode Enable" mask="0x08" name="FREERUN"/>
          <bitfield caption="Result Resolution" mask="0x06" name="RESOLUTION" values="ADC_RESOLUTION"/>
        </register>
        <register caption="Reference Control" name="REFCTRL" offset="0x02" size="1">
          <bitfield caption="Reference Selection" mask="0x70" name="REFSEL" values="ADC_REFSEL"/>
          <bitfield caption="Bandgap enable" mask="0x02" name="BANDGAP"/>
          <bitfield caption="Temperature Reference Enable" mask="0x01" name="TEMPREF"/>
        </register>
        <register caption="Event Control" name="EVCTRL" offset="0x03" size="1">
          <bitfield caption="Event Input Select" mask="0x18" name="EVSEL" values="ADC_EVSEL"/>
          <bitfield caption="Event Action Select" mask="0x07" name="EVACT" values="ADC_EVACT"/>
        </register>
        <register caption="Clock Prescaler" name="PRESCALER" offset="0x04" size="1">
          <bitfield caption="Clock Prescaler Selection" mask="0x07" name="PRESCALER" values="ADC_PRESCALER"/>
        </register>
        <register caption="Interrupt Flags" name="INTFLAGS" offset="0x06" size="1">
          <bitfield caption="Channel 0 Interrupt Flag" mask="0x01" name="CH0IF"/>
        </register>
        <register caption="Temporary Register" name="TEMP" offset="0x07" size="1"/>
        <register caption="ADC Sampling Time Control Register" name="SAMPCTRL" offset="0x08" size="1">
          <bitfield caption="Sampling time control register" mask="0x03F" name="SAMPVAL"/>
        </register>
        <register caption="Calibration Value" name="CAL" offset="0x0C" size="2"/>
        <register caption="Channel 0 Result" name="CH0RES" offset="0x10" size="2"/>
        <register caption="Compare Value" name="CMP" offset="0x18" size="2"/>
        <register-group caption="ADC Channel 0" name="CH0" offset="0x20" name-in-module="ADC_CH"/></register-group>
      <value-group caption="Current Limitation" name="ADC_CURRLIMIT">
        <value caption="No current limit,     300ksps max sampling rate" name="NO" value="0x00"/>
        <value caption="Low current limit,    250ksps max sampling rate" name="LOW" value="0x01"/>
        <value caption="Medium current limit, 150ksps max sampling rate" name="MED" value="0x02"/>
        <value caption="High current limit,   50ksps max sampling rate" name="HIGH" value="0x03"/>
      </value-group>
      <value-group caption="Positive input multiplexer selection" name="ADC_CH_MUXPOS">
        <value caption="Input pin 0" name="PIN0" value="0x00"/>
        <value caption="Input pin 1" name="PIN1" value="0x01"/>
        <value caption="Input pin 2" name="PIN2" value="0x02"/>
        <value caption="Input pin 3" name="PIN3" value="0x03"/>
        <value caption="Input pin 4" name="PIN4" value="0x04"/>
        <value caption="Input pin 5" name="PIN5" value="0x05"/>
        <value caption="Input pin 6" name="PIN6" value="0x06"/>
        <value caption="Input pin 7" name="PIN7" value="0x07"/>
        <value caption="Input pin 8" name="PIN8" value="0x08"/>
        <value caption="Input pin 9" name="PIN9" value="0x09"/>
        <value caption="Input pin 10" name="PIN10" value="0x0A"/>
        <value caption="Input pin 11" name="PIN11" value="0x0B"/>
        <value caption="Input pin 12" name="PIN12" value="0x0C"/>
        <value caption="Input pin 13" name="PIN13" value="0x0D"/>
        <value caption="Input pin 14" name="PIN14" value="0x0E"/>
        <value caption="Input pin 15" name="PIN15" value="0x0F"/>
      </value-group>
      <value-group caption="Internal input multiplexer selections" name="ADC_CH_MUXINT">
        <value caption="Temperature Reference" name="TEMP" value="0x00"/>
        <value caption="Bandgap Reference" name="BANDGAP" value="0x01"/>
        <value caption="1/10 scaled VCC" name="SCALEDVCC" value="0x02"/>
      </value-group>
      <value-group caption="Negative input multiplexer selection" name="ADC_CH_MUXNEG">
        <value caption="Input pin 0 (if INPUTMODE = 2)" name="PIN0" value="0x00"/>
        <value caption="Input pin 1 (if INPUTMODE = 2)" name="PIN1" value="0x01"/>
        <value caption="Input pin 2 (if INPUTMODE = 2)" name="PIN2" value="0x02"/>
        <value caption="Input pin 3 (if INPUTMODE = 2)" name="PIN3" value="0x03"/>
        <value caption="Input pin 4 (if INPUTMODE = 3)" name="PIN4" value="0x00"/>
        <value caption="Input pin 5 (if INPUTMODE = 3)" name="PIN5" value="0x01"/>
        <value caption="Input pin 6 (if INPUTMODE = 3)" name="PIN6" value="0x02"/>
        <value caption="Input pin 7 (if INPUTMODE = 3)" name="PIN7" value="0x03"/>
        <value caption="PAD Ground (if INPUTMODE = 2)" name="GND_MODE3" value="0x05"/>
        <value caption="Internal Ground (if INPUTMODE = 2)" name="INTGND_MODE3" value="0x07"/>
        <value caption="Internal Ground (if INPUTMODE = 3)" name="INTGND_MODE4" value="0x04"/>
        <value caption="PAD Ground (if INPUTMODE = 3)" name="GND_MODE4" value="0x07"/>	
      </value-group>
      <value-group caption="Negative input multiplexer selection when gain on 4 LSB pins" name="ADC_CH_MUXNEGL">
        <value caption="Input pin 0" name="PIN0" value="0x00"/>
        <value caption="Input pin 1" name="PIN1" value="0x01"/>
        <value caption="Input pin 2" name="PIN2" value="0x02"/>
        <value caption="Input pin 3" name="PIN3" value="0x03"/>
        <value caption="PAD ground" name="GND" value="0x05"/>
        <value caption="Internal ground" name="INTGND" value="0x07"/>
      </value-group>
